---
kind: property
id: P:Autodesk.Revit.DB.Ellipse.YDirection
source: html/47f16b56-5a44-2e23-3ca7-ba7001bd922c.htm
---
# Autodesk.Revit.DB.Ellipse.YDirection Property

The Y direction.

## Syntax (C#)
```csharp
public XYZ YDirection { get; }
```